{"keras_version": "2.2.4", "config": {"layers": [{"config": {"dtype": "float32", "trainable": true, "mask_zero": false, "embeddings_regularizer": null, "input_length": 234, "batch_input_shape": [null, 234], "name": "embedding_1", "input_dim": 67457, "activity_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "output_dim": 100}, "class_name": "Embedding"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"layer": {"config": {"stateful": false, "recurrent_constraint": null, "dropout": 0.0, "use_bias": true, "implementation": 1, "unroll": false, "return_sequences": false, "activation": "tanh", "activity_regularizer": null, "name": "lstm_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "units": 100, "return_state": false}, "class_name": "LSTM"}, "name": "bidirectional_1", "trainable": true, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"name": "dropout_2", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 2, "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow"}