{"config": {"layers": [{"config": {"output_dim": 100, "input_length": 234, "dtype": "float32", "embeddings_regularizer": null, "embeddings_constraint": null, "name": "embedding_12", "batch_input_shape": [null, 234], "input_dim": 67457, "mask_zero": false, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "trainable": true, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"seed": null, "rate": 0.25, "trainable": true, "name": "dropout_23", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "merge_mode": "concat", "name": "bidirectional_12", "layer": {"config": {"return_state": false, "implementation": 1, "bias_constraint": null, "return_sequences": false, "go_backwards": false, "use_bias": true, "unroll": false, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dropout": 0.0, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_12", "units": 100, "recurrent_constraint": null, "activation": "tanh", "recurrent_dropout": 0.0, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}}, "class_name": "Bidirectional"}, {"config": {"seed": null, "rate": 0.5, "trainable": true, "name": "dropout_24", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_12", "use_bias": true, "units": 2, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_12"}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}